'''
Список чисел
На вход программе подаётся одно число n. 
Напишите программу, которая выводит список [1, 2, 3, ..., n].
На вход программе подаётся одно натуральное число.
Программа должна вывести текст в соответствии с условием задачи.
'''

n = int(input())
print(list(range(1, n + 1)))