'''
sWAP cASE
На вход программе подаётся строка. 
Напишите программу, которая меняет регистр символов – 
заменяет все строчные символы заглавными и наоборот.
Программа должна вывести строку в соответствии с условием задачи.
'''

s = input()
print(s.swapcase())