'''
Дробная часть
Дано положительное действительное число. 
Выведите его дробную часть.
'''

n = float(input())
fractional_part = n - int(n)
print(fractional_part)