'''
Правильный многоугольник
Правильный многоугольник — выпуклый многоугольник, 
у которого равны все стороны и все углы между смежными сторонами. 
Площадь правильного многоугольника с длиной стороны a 
и количеством сторон n вычисляется по формуле.
Даны два числа: натуральное число n и действительное число a. 
Напишите программу, которая находит площадь указанного правильного многоугольника.
'''

from math import tan, pi
n, a = int(input()), float(input())
area = (n * a ** 2) / (4 * tan(pi / n))
print(area)