'''
What's Your Name?
Напишите программу, которая считывает с клавиатуры две строки – 
имя и фамилию пользователя – и выводит фразу:
Hello <введённое имя> <введённая фамилия>! You have just delved into Python
'''

name = input()
surname = input()
print(f"Hello {name} {surname}! You have just delved into Python")